{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<pad>": 0,
      "<unk>": 1,
      "<bos>": 2,
      "<eos>": 3,
      "!": 4,
      "\"": 5,
      "#": 6,
      "&": 7,
      "(": 8,
      ")": 9,
      ",": 10,
      "-": 11,
      ".": 12,
      "0": 13,
      "1": 14,
      "2": 15,
      "3": 16,
      "4": 17,
      "6": 18,
      ":": 19,
      ";": 20,
      "<": 21,
      "=": 22,
      ">": 23,
      "B": 24,
      "C": 25,
      "D": 26,
      "E": 27,
      "H": 28,
      "I": 29,
      "M": 30,
      "N": 31,
      "O": 32,
      "P": 33,
      "R": 34,
      "S": 35,
      "T": 36,
      "V": 37,
      "[": 38,
      "]": 39,
      "a": 40,
      "b": 41,
      "c": 42,
      "d": 43,
      "e": 44,
      "f": 45,
      "g": 46,
      "h": 47,
      "i": 48,
      "k": 49,
      "l": 50,
      "m": 51,
      "n": 52,
      "o": 53,
      "p": 54,
      "r": 55,
      "s": 56,
      "t": 57,
      "u": 58,
      "v": 59,
      "w": 60,
      "x": 61,
      "y": 62,
      "{": 63,
      "}": 64,
      "Ġ": 65,
      "Ġ{": 66,
      "Ġ}": 67,
      "Ġf": 68,
      "in": 69,
      "::": 70,
      "64": 71,
      "ec": 72,
      "el": 73,
      "or": 74,
      "pu": 75,
      "tr": 76,
      "er": 77,
      "ne": 78,
      "Ġs": 79,
      "elf": 80,
      "pub": 81,
      "!(": 82,
      ");": 83,
      "->": 84,
      "It": 85,
      "Self": 86,
      "en": 87,
      "Ġ=": 88,
      "Ġv": 89,
      "Ġy": 90,
      "Ġ->": 91,
      "Ġfn": 92,
      "int": 93,
      "Er": 94,
      "Po": 95,
      "Str": 96,
      "Vec": 97,
      "al": 98,
      "as": 99,
      "at": 100,
      "ch": 101,
      "em": 102,
      "es": 103,
      "et": 104,
      "io": 105,
      "lo": 106,
      "lt": 107,
      "mu": 108,
      "ror": 109,
      "td": 110,
      "tio": 111,
      "um": 112,
      "ult": 113,
      "yn": 114,
      "ĠO": 115,
      "Ġp": 116,
      "Ġt": 117,
      "Ġx": 118,
      "Ġne": 119,
      "Ġpub": 120,
      "ĠIt": 121,
      "ĠSelf": 122,
      "ĠPo": 123,
      "ĠVec": 124,
      "ing": 125,
      "Ġstd": 126,
      "!(\"": 127,
      "Ġ=>": 128,
      "Ġvec": 129,
      "String": 130,
      "esult": 131,
      "mut": 132,
      "tion": 133,
      "ĠPoint": 134,
      "!\"": 135,
      "\",": 136,
      "#[": 137,
      "(&": 138,
      "()": 139,
      "();": 140,
      "),": 141,
      ")]": 142,
      "..": 143,
      "10": 144,
      "32": 145,
      ">;": 146,
      ">>": 147,
      "Bo": 148,
      "Clo": 149,
      "De": 150,
      "Hel": 151,
      "Has": 152,
      "Id": 153,
      "Ma": 154,
      "Num": 155,
      "Result": 156,
      "To": 157,
      "ai": 158,
      "an": 159,
      "ain": 160,
      "bu": 161,
      "ber": 162,
      "co": 163,
      "ct": 164,
      "do": 165,
      "der": 166,
      "dyn": 167,
      "fn": 168,
      "for": 169,
      "hMa": 170,
      "ic": 171,
      "im": 172,
      "iv": 173,
      "ken": 174,
      "ld": 175,
      "ll": 176,
      "ln": 177,
      "let": 178,
      "mat": 179,
      "main": 180,
      "odo": 181,
      "pe": 182,
      "pl": 183,
      "ption": 184,
      "rl": 185,
      "rint": 186,
      "result": 187,
      "se": 188,
      "sh": 189,
      "str": 190,
      "uct": 191,
      "url": 192,
      "use": 193,
      "val": 194,
      "wor": 195,
      "xt": 196,
      "ype": 197,
      "{}": 198,
      "Ġ&": 199,
      "Ġ0": 200,
      "Ġe": 201,
      "Ġi": 202,
      "Ġin": 203,
      "Ġtr": 204,
      "Ġen": 205,
      "ĠEr": 206,
      "Ġmut": 207,
      "ĠBo": 208,
      "ĠClo": 209,
      "ĠId": 210,
      "ĠNum": 211,
      "ĠResult": 212,
      "ĠTo": 213,
      "Ġmain": 214,
      "Ġresult": 215,
      "Ġwor": 216,
      "Ġfet": 217,
      "ection": 218,
      "push": 219,
      "truct": 220,
      "erat": 221,
      "error": 222,
      "new": 223,
      "Ġself": 224,
      "Ġstruct": 225,
      "!()": 226,
      "Item": 227,
      "ent": 228,
      "Ġval": 229,
      "Error": 230,
      "asyn": 231,
      "ĠOk": 232,
      "ĠOption": 233,
      "Ġpan": 234,
      "Ġprint": 235,
      "Ġtodo": 236,
      "Ġtype": 237,
      "Ġnew": 238,
      "Ġnext": 239,
      "ĠItem": 240,
      "ĠIterat": 241,
      "!(\"{}": 242,
      "!\");": 243,
      "Debu": 244,
      "Hello": 245,
      "HashMa": 246,
      "ait": 247,
      "coll": 248,
      "deriv": 249,
      "impl": 250,
      "match": 251,
      "Ġtrait": 252,
      "Ġenum": 253,
      "ĠErr": 254,
      "ĠBox": 255,
      "ĠClone": 256,
      "ĠIdent": 257,
      "ĠNumber": 258,
      "ĠToken": 259,
      "Ġworld": 260,
      "Ġfetch": 261,
      "ections": 262,
      "async": 263,
      "Ġpanic": 264,
      "Ġprintln": 265,
      "ĠIterator": 266,
      "!(\"{}\",": 267,
      "Debug": 268,
      "HashMap": 269,
      "collections": 270,
      "derive": 271
    },
    "merges": [
      [
        "Ġ",
        "{"
      ],
      [
        "Ġ",
        "}"
      ],
      [
        "Ġ",
        "f"
      ],
      [
        "i",
        "n"
      ],
      [
        ":",
        ":"
      ],
      [
        "6",
        "4"
      ],
      [
        "e",
        "c"
      ],
      [
        "e",
        "l"
      ],
      [
        "o",
        "r"
      ],
      [
        "p",
        "u"
      ],
      [
        "t",
        "r"
      ],
      [
        "e",
        "r"
      ],
      [
        "n",
        "e"
      ],
      [
        "Ġ",
        "s"
      ],
      [
        "el",
        "f"
      ],
      [
        "pu",
        "b"
      ],
      [
        "!",
        "("
      ],
      [
        ")",
        ";"
      ],
      [
        "-",
        ">"
      ],
      [
        "I",
        "t"
      ],
      [
        "S",
        "elf"
      ],
      [
        "e",
        "n"
      ],
      [
        "Ġ",
        "="
      ],
      [
        "Ġ",
        "v"
      ],
      [
        "Ġ",
        "y"
      ],
      [
        "Ġ",
        "->"
      ],
      [
        "Ġf",
        "n"
      ],
      [
        "in",
        "t"
      ],
      [
        "E",
        "r"
      ],
      [
        "P",
        "o"
      ],
      [
        "S",
        "tr"
      ],
      [
        "V",
        "ec"
      ],
      [
        "a",
        "l"
      ],
      [
        "a",
        "s"
      ],
      [
        "a",
        "t"
      ],
      [
        "c",
        "h"
      ],
      [
        "e",
        "m"
      ],
      [
        "e",
        "s"
      ],
      [
        "e",
        "t"
      ],
      [
        "i",
        "o"
      ],
      [
        "l",
        "o"
      ],
      [
        "l",
        "t"
      ],
      [
        "m",
        "u"
      ],
      [
        "r",
        "or"
      ],
      [
        "t",
        "d"
      ],
      [
        "t",
        "io"
      ],
      [
        "u",
        "m"
      ],
      [
        "u",
        "lt"
      ],
      [
        "y",
        "n"
      ],
      [
        "Ġ",
        "O"
      ],
      [
        "Ġ",
        "p"
      ],
      [
        "Ġ",
        "t"
      ],
      [
        "Ġ",
        "x"
      ],
      [
        "Ġ",
        "ne"
      ],
      [
        "Ġ",
        "pub"
      ],
      [
        "Ġ",
        "It"
      ],
      [
        "Ġ",
        "Self"
      ],
      [
        "Ġ",
        "Po"
      ],
      [
        "Ġ",
        "Vec"
      ],
      [
        "in",
        "g"
      ],
      [
        "Ġs",
        "td"
      ],
      [
        "!(",
        "\""
      ],
      [
        "Ġ=",
        ">"
      ],
      [
        "Ġv",
        "ec"
      ],
      [
        "Str",
        "ing"
      ],
      [
        "es",
        "ult"
      ],
      [
        "mu",
        "t"
      ],
      [
        "tio",
        "n"
      ],
      [
        "ĠPo",
        "int"
      ],
      [
        "!",
        "\""
      ],
      [
        "\"",
        ","
      ],
      [
        "#",
        "["
      ],
      [
        "(",
        "&"
      ],
      [
        "(",
        ")"
      ],
      [
        "(",
        ");"
      ],
      [
        ")",
        ","
      ],
      [
        ")",
        "]"
      ],
      [
        ".",
        "."
      ],
      [
        "1",
        "0"
      ],
      [
        "3",
        "2"
      ],
      [
        ">",
        ";"
      ],
      [
        ">",
        ">"
      ],
      [
        "B",
        "o"
      ],
      [
        "C",
        "lo"
      ],
      [
        "D",
        "e"
      ],
      [
        "H",
        "el"
      ],
      [
        "H",
        "as"
      ],
      [
        "I",
        "d"
      ],
      [
        "M",
        "a"
      ],
      [
        "N",
        "um"
      ],
      [
        "R",
        "esult"
      ],
      [
        "T",
        "o"
      ],
      [
        "a",
        "i"
      ],
      [
        "a",
        "n"
      ],
      [
        "a",
        "in"
      ],
      [
        "b",
        "u"
      ],
      [
        "b",
        "er"
      ],
      [
        "c",
        "o"
      ],
      [
        "c",
        "t"
      ],
      [
        "d",
        "o"
      ],
      [
        "d",
        "er"
      ],
      [
        "d",
        "yn"
      ],
      [
        "f",
        "n"
      ],
      [
        "f",
        "or"
      ],
      [
        "h",
        "Ma"
      ],
      [
        "i",
        "c"
      ],
      [
        "i",
        "m"
      ],
      [
        "i",
        "v"
      ],
      [
        "k",
        "en"
      ],
      [
        "l",
        "d"
      ],
      [
        "l",
        "l"
      ],
      [
        "l",
        "n"
      ],
      [
        "l",
        "et"
      ],
      [
        "m",
        "at"
      ],
      [
        "m",
        "ain"
      ],
      [
        "o",
        "do"
      ],
      [
        "p",
        "e"
      ],
      [
        "p",
        "l"
      ],
      [
        "p",
        "tion"
      ],
      [
        "r",
        "l"
      ],
      [
        "r",
        "int"
      ],
      [
        "r",
        "esult"
      ],
      [
        "s",
        "e"
      ],
      [
        "s",
        "h"
      ],
      [
        "s",
        "tr"
      ],
      [
        "u",
        "ct"
      ],
      [
        "u",
        "rl"
      ],
      [
        "u",
        "se"
      ],
      [
        "v",
        "al"
      ],
      [
        "w",
        "or"
      ],
      [
        "x",
        "t"
      ],
      [
        "y",
        "pe"
      ],
      [
        "{",
        "}"
      ],
      [
        "Ġ",
        "&"
      ],
      [
        "Ġ",
        "0"
      ],
      [
        "Ġ",
        "e"
      ],
      [
        "Ġ",
        "i"
      ],
      [
        "Ġ",
        "in"
      ],
      [
        "Ġ",
        "tr"
      ],
      [
        "Ġ",
        "en"
      ],
      [
        "Ġ",
        "Er"
      ],
      [
        "Ġ",
        "mut"
      ],
      [
        "Ġ",
        "Bo"
      ],
      [
        "Ġ",
        "Clo"
      ],
      [
        "Ġ",
        "Id"
      ],
      [
        "Ġ",
        "Num"
      ],
      [
        "Ġ",
        "Result"
      ],
      [
        "Ġ",
        "To"
      ],
      [
        "Ġ",
        "main"
      ],
      [
        "Ġ",
        "result"
      ],
      [
        "Ġ",
        "wor"
      ],
      [
        "Ġf",
        "et"
      ],
      [
        "ec",
        "tion"
      ],
      [
        "pu",
        "sh"
      ],
      [
        "tr",
        "uct"
      ],
      [
        "er",
        "at"
      ],
      [
        "er",
        "ror"
      ],
      [
        "ne",
        "w"
      ],
      [
        "Ġs",
        "elf"
      ],
      [
        "Ġs",
        "truct"
      ],
      [
        "!(",
        ")"
      ],
      [
        "It",
        "em"
      ],
      [
        "en",
        "t"
      ],
      [
        "Ġv",
        "al"
      ],
      [
        "Er",
        "ror"
      ],
      [
        "as",
        "yn"
      ],
      [
        "ĠO",
        "k"
      ],
      [
        "ĠO",
        "ption"
      ],
      [
        "Ġp",
        "an"
      ],
      [
        "Ġp",
        "rint"
      ],
      [
        "Ġt",
        "odo"
      ],
      [
        "Ġt",
        "ype"
      ],
      [
        "Ġne",
        "w"
      ],
      [
        "Ġne",
        "xt"
      ],
      [
        "ĠIt",
        "em"
      ],
      [
        "ĠIt",
        "erat"
      ],
      [
        "!(\"",
        "{}"
      ],
      [
        "!\"",
        ");"
      ],
      [
        "De",
        "bu"
      ],
      [
        "Hel",
        "lo"
      ],
      [
        "Has",
        "hMa"
      ],
      [
        "ai",
        "t"
      ],
      [
        "co",
        "ll"
      ],
      [
        "der",
        "iv"
      ],
      [
        "im",
        "pl"
      ],
      [
        "mat",
        "ch"
      ],
      [
        "Ġtr",
        "ait"
      ],
      [
        "Ġen",
        "um"
      ],
      [
        "ĠEr",
        "r"
      ],
      [
        "ĠBo",
        "x"
      ],
      [
        "ĠClo",
        "ne"
      ],
      [
        "ĠId",
        "ent"
      ],
      [
        "ĠNum",
        "ber"
      ],
      [
        "ĠTo",
        "ken"
      ],
      [
        "Ġwor",
        "ld"
      ],
      [
        "Ġfet",
        "ch"
      ],
      [
        "ection",
        "s"
      ],
      [
        "asyn",
        "c"
      ],
      [
        "Ġpan",
        "ic"
      ],
      [
        "Ġprint",
        "ln"
      ],
      [
        "ĠIterat",
        "or"
      ],
      [
        "!(\"{}",
        "\","
      ],
      [
        "Debu",
        "g"
      ],
      [
        "HashMa",
        "p"
      ],
      [
        "coll",
        "ections"
      ],
      [
        "deriv",
        "e"
      ]
    ]
  }
}