{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<pad>": 0,
      "<unk>": 1,
      "<bos>": 2,
      "<eos>": 3,
      "!": 4,
      "\"": 5,
      "(": 6,
      ")": 7,
      "+": 8,
      ",": 9,
      "-": 10,
      ".": 11,
      "0": 12,
      "1": 13,
      "2": 14,
      "3": 15,
      "4": 16,
      "6": 17,
      ":": 18,
      ";": 19,
      "=": 20,
      ">": 21,
      "E": 22,
      "H": 23,
      "M": 24,
      "O": 25,
      "P": 26,
      "S": 27,
      "W": 28,
      "a": 29,
      "b": 30,
      "c": 31,
      "d": 32,
      "e": 33,
      "f": 34,
      "h": 35,
      "i": 36,
      "k": 37,
      "l": 38,
      "m": 39,
      "n": 40,
      "o": 41,
      "p": 42,
      "r": 43,
      "s": 44,
      "t": 45,
      "u": 46,
      "v": 47,
      "w": 48,
      "x": 49,
      "y": 50,
      "{": 51,
      "}": 52,
      "Ġ": 53,
      "Ġf": 54,
      "Ġ{": 55,
      "Ġ}": 56,
      "Ġi": 57,
      "in": 58,
      "Ġp": 59,
      "64": 60,
      "int": 61,
      "!(": 62,
      "32": 63,
      "el": 64,
      "Ġ=": 65,
      "Ġx": 66,
      "Ġy": 67,
      "Ġfn": 68,
      ");": 69,
      "->": 70,
      "::": 71,
      "Po": 72,
      "Sel": 73,
      "al": 74,
      "ct": 75,
      "le": 76,
      "ln": 77,
      "ma": 78,
      "or": 79,
      "rint": 80,
      "st": 81,
      "ub": 82,
      "val": 83,
      "Ġa": 84,
      "Ġb": 85,
      "Ġ->": 86,
      "ĠPo": 87,
      "ĠSel": 88,
      "Ġma": 89,
      "Ġst": 90,
      "Ġprint": 91,
      "Ġpub": 92,
      "!(\"": 93,
      "Ġ=>": 94,
      "ĠPoint": 95,
      "ĠSelf": 96,
      "Ġprintln": 97,
      "!\"": 98,
      "\",": 99,
      "()": 100,
      "..": 101,
      "10": 102,
      "42": 103,
      "Er": 104,
      "Ha": 105,
      "Hel": 106,
      "Ma": 107,
      "Ok": 108,
      "Wor": 109,
      "an": 110,
      "ch": 111,
      "co": 112,
      "dd": 113,
      "es": 114,
      "ew": 115,
      "hMa": 116,
      "ic": 117,
      "io": 118,
      "ld": 119,
      "lo": 120,
      "lt": 121,
      "lle": 122,
      "mp": 123,
      "ns": 124,
      "new": 125,
      "ru": 126,
      "res": 127,
      "se": 128,
      "shMa": 129,
      "tch": 130,
      "ult": 131,
      "use": 132,
      "{}": 133,
      "Ġ+": 134,
      "Ġ0": 135,
      "Ġle": 136,
      "Ġval": 137,
      "Ġ42": 138,
      "ĠEr": 139,
      "ĠOk": 140,
      "ĠWor": 141,
      "Ġnew": 142,
      "Ġres": 143,
      "Ġuse": 144,
      "Ġfor": 145,
      "Ġin": 146,
      "Ġimp": 147,
      "Ġpan": 148,
      "ctio": 149,
      "Ġadd": 150,
      "Ġmain": 151,
      "Ġmatch": 152,
      "Ġstd": 153,
      "Ġstru": 154,
      "!(\"{}": 155,
      "!\");": 156,
      "HashMa": 157,
      "Hello": 158,
      "colle": 159,
      "Ġlet": 160,
      "ĠErr": 161,
      "ĠWorld": 162,
      "Ġresult": 163,
      "Ġimpl": 164,
      "Ġpanic": 165,
      "ctions": 166,
      "Ġstruct": 167,
      "!(\"{}\",": 168,
      "HashMap": 169,
      "collections": 170
    },
    "merges": [
      [
        "Ġ",
        "f"
      ],
      [
        "Ġ",
        "{"
      ],
      [
        "Ġ",
        "}"
      ],
      [
        "Ġ",
        "i"
      ],
      [
        "i",
        "n"
      ],
      [
        "Ġ",
        "p"
      ],
      [
        "6",
        "4"
      ],
      [
        "in",
        "t"
      ],
      [
        "!",
        "("
      ],
      [
        "3",
        "2"
      ],
      [
        "e",
        "l"
      ],
      [
        "Ġ",
        "="
      ],
      [
        "Ġ",
        "x"
      ],
      [
        "Ġ",
        "y"
      ],
      [
        "Ġf",
        "n"
      ],
      [
        ")",
        ";"
      ],
      [
        "-",
        ">"
      ],
      [
        ":",
        ":"
      ],
      [
        "P",
        "o"
      ],
      [
        "S",
        "el"
      ],
      [
        "a",
        "l"
      ],
      [
        "c",
        "t"
      ],
      [
        "l",
        "e"
      ],
      [
        "l",
        "n"
      ],
      [
        "m",
        "a"
      ],
      [
        "o",
        "r"
      ],
      [
        "r",
        "int"
      ],
      [
        "s",
        "t"
      ],
      [
        "u",
        "b"
      ],
      [
        "v",
        "al"
      ],
      [
        "Ġ",
        "a"
      ],
      [
        "Ġ",
        "b"
      ],
      [
        "Ġ",
        "->"
      ],
      [
        "Ġ",
        "Po"
      ],
      [
        "Ġ",
        "Sel"
      ],
      [
        "Ġ",
        "ma"
      ],
      [
        "Ġ",
        "st"
      ],
      [
        "Ġp",
        "rint"
      ],
      [
        "Ġp",
        "ub"
      ],
      [
        "!(",
        "\""
      ],
      [
        "Ġ=",
        ">"
      ],
      [
        "ĠPo",
        "int"
      ],
      [
        "ĠSel",
        "f"
      ],
      [
        "Ġprint",
        "ln"
      ],
      [
        "!",
        "\""
      ],
      [
        "\"",
        ","
      ],
      [
        "(",
        ")"
      ],
      [
        ".",
        "."
      ],
      [
        "1",
        "0"
      ],
      [
        "4",
        "2"
      ],
      [
        "E",
        "r"
      ],
      [
        "H",
        "a"
      ],
      [
        "H",
        "el"
      ],
      [
        "M",
        "a"
      ],
      [
        "O",
        "k"
      ],
      [
        "W",
        "or"
      ],
      [
        "a",
        "n"
      ],
      [
        "c",
        "h"
      ],
      [
        "c",
        "o"
      ],
      [
        "d",
        "d"
      ],
      [
        "e",
        "s"
      ],
      [
        "e",
        "w"
      ],
      [
        "h",
        "Ma"
      ],
      [
        "i",
        "c"
      ],
      [
        "i",
        "o"
      ],
      [
        "l",
        "d"
      ],
      [
        "l",
        "o"
      ],
      [
        "l",
        "t"
      ],
      [
        "l",
        "le"
      ],
      [
        "m",
        "p"
      ],
      [
        "n",
        "s"
      ],
      [
        "n",
        "ew"
      ],
      [
        "r",
        "u"
      ],
      [
        "r",
        "es"
      ],
      [
        "s",
        "e"
      ],
      [
        "s",
        "hMa"
      ],
      [
        "t",
        "ch"
      ],
      [
        "u",
        "lt"
      ],
      [
        "u",
        "se"
      ],
      [
        "{",
        "}"
      ],
      [
        "Ġ",
        "+"
      ],
      [
        "Ġ",
        "0"
      ],
      [
        "Ġ",
        "le"
      ],
      [
        "Ġ",
        "val"
      ],
      [
        "Ġ",
        "42"
      ],
      [
        "Ġ",
        "Er"
      ],
      [
        "Ġ",
        "Ok"
      ],
      [
        "Ġ",
        "Wor"
      ],
      [
        "Ġ",
        "new"
      ],
      [
        "Ġ",
        "res"
      ],
      [
        "Ġ",
        "use"
      ],
      [
        "Ġf",
        "or"
      ],
      [
        "Ġi",
        "n"
      ],
      [
        "Ġi",
        "mp"
      ],
      [
        "Ġp",
        "an"
      ],
      [
        "ct",
        "io"
      ],
      [
        "Ġa",
        "dd"
      ],
      [
        "Ġma",
        "in"
      ],
      [
        "Ġma",
        "tch"
      ],
      [
        "Ġst",
        "d"
      ],
      [
        "Ġst",
        "ru"
      ],
      [
        "!(\"",
        "{}"
      ],
      [
        "!\"",
        ");"
      ],
      [
        "Ha",
        "shMa"
      ],
      [
        "Hel",
        "lo"
      ],
      [
        "co",
        "lle"
      ],
      [
        "Ġle",
        "t"
      ],
      [
        "ĠEr",
        "r"
      ],
      [
        "ĠWor",
        "ld"
      ],
      [
        "Ġres",
        "ult"
      ],
      [
        "Ġimp",
        "l"
      ],
      [
        "Ġpan",
        "ic"
      ],
      [
        "ctio",
        "ns"
      ],
      [
        "Ġstru",
        "ct"
      ],
      [
        "!(\"{}",
        "\","
      ],
      [
        "HashMa",
        "p"
      ],
      [
        "colle",
        "ctions"
      ]
    ]
  }
}